In [5]:
%matplotlib inline
import pandas as pd

In [6]:
titles = pd.read_csv('C:/Users/harish/Desktop/LETS UPGRADE/cast.csv')
titles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [7]:
len(titles)

3786176

### What are the earliest two films listed in the titles dataframe?

In [8]:
titles.sort_values('year').head(2)

,title,year,name,type,character,n
2612704,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
482247,Miss Jerry,1894,William Courtenay,actor,Mr. Hamilton,NaN

### How many movies have the title "Hamlet"?

In [9]:
len(titles[titles.title=='Hamlet'])

342

### How many movies are titled "North by Northwest"?

In [10]:
len(titles[titles.title=="North by Northwest"])

116

### When was the first movie titled "Hamlet" made?

In [11]:
titles[titles.title=="Hamlet"].sort_values('year').head(1)

          title  year               name   type character   n
1602320  Hamlet  1910  Jean Mounet-Sully  actor    Hamlet NaN

### List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
titles[titles.title=="Treasure Island"].sort_values("year")

,title,year,name,type,character,n
860800,Treasure Island,1918,Charles Gorman,actor,Prologue Player,NaN
871803,Treasure Island,1918,Joe Grant,actor,Undetermined child role,NaN
942632,Treasure Island,1918,Edwin Harley,actor,Prologue Player,NaN
3450730,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1778878,Treasure Island,1918,Lloyd Perl,actor,Black Dog,4.0
...,...,...,...,...,...,...
2511526,Treasure Island,1999,Caveh Zahedi,actor,Harold,9.0
1698413,Treasure Island,1999,Nick Offerman,actor,Samuel,2.0
1426457,Treasure Island,1999,J.P. Manoux,actor,Officer Hughes,18.0
3340561,Treasure Island,1999,Suzy Nakamura,actress,Yo-Ji,5.0
319551,Treasure Island,1999,Bob Byington,actor,Thomas,12.0

### How many movies were made in the year 1950?

In [13]:
len(titles[titles.year==1950])

22397

### How many movies were made in the year 1960?

In [14]:
len(titles[titles.year==1960])

19164

### How many movies were made from 1950 through 1959?

In [16]:
t=titles
len(t[(t.year>=1950)&(t.year<=1959)])

215471

### In what years has a movie titled "Batman" been released?

In [17]:
t[t.title=="Batman"].sort_values("year")

          title  year               name     type            character     n
99564    Batman  1943       Frank Austin    actor          Hotel Clerk   NaN
1630712  Batman  1943    J. Carrol Naish    actor             Dr. Daka   3.0
1543957  Batman  1943      Harold Miller    actor    Restaurant Patron   NaN
1535655  Batman  1943  Charles Middleton    actor  Ken Colton [Ch. 6-8   NaN
1425465  Batman  1943       Knox Manning    actor             Narrator   NaN
...         ...   ...                ...      ...                  ...   ...
1533741  Batman  1989     Wayne Michaels    actor          Napier Hood  33.0
1532950  Batman  1989       Paul Michael    actor                  Cop  56.0
1531346  Batman  1989      Adrian Meyers    actor   Jimmy, Tourist Son  47.0
1487725  Batman  1989       Mac McDonald    actor                 Goon  15.0
3513305  Batman  1989        Rachel Ryan  actress               Corpse   NaN

[123 rows x 6 columns]

### How many roles were there in the movie "Inception"?

In [25]:
len(t.title=="Inception")

3786176

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [32]:
rank=t[t.title=="Inception"]
rank.isna().sum().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [44]:
rank=t[t.title=="Inception"]
len(rank.dropna())

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [52]:
t[t.title=="North by Northwest"].dropna()

,title,year,name,type,character,n
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [64]:
t2=titles[(titles.title=="Sleuth")&(titles.year==1972)].sort_values("n")
t2.dropna()

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [65]:
t2=titles[(titles.title=="Sleuth")&(titles.year==2007)].sort_values("n")
t2.dropna()

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [67]:
len(t[(t.title=="Hamlet")&(t.year==1921)])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [68]:
len(t[(t.title=="Hamlet")&(t.year==1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [70]:
len(t[t.title=="Hamlet"])

342

### How many people have played an "Ophelia"?

In [72]:
len(t[t.character=="Ophelia"])

117

### How many people have played a role called "The Dude"?

In [73]:
len(t[t.character=="The Dude"])

19

### How many people have played a role called "The Stranger"?

In [74]:
len(t[t.character=="The Stranger"])

212

### How many roles has Sidney Poitier played throughout his career?

In [75]:
len(t[t.name=="Sidney Poitier"])

43

### How many roles has Judi Dench played?

In [77]:
len(t[t.name=="Judi Dench"])

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [80]:
t[(t.name=="Cary Grant")&(t.year==1940)&(t.n==2)].sort_values("year")

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [81]:
t[(t.name=="Cary Grant")&(t.year==1940)].sort_values("year")

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [83]:
len(t[(t.type=="actor")&(t.year==1950)])

16760

### How many roles were available for actresses in the 1950s?

In [84]:
len(t[(t.type=="actress")&(t.year==1950)])

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [85]:
len(t[(t.n==1)&(t.year<=1980)])

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [90]:
t3=t[t.year<=1980]
len(t3.dropna())

734460

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [91]:
t3=t[t.year>=1980]
len(t3.dropna())

1612149